Repository: lawrancej/logisim
Catalog: xlate/ru/resources/omegat-logisim-resources_ru-level1.tmx
Source language: en
Languages: ru_ru

source: Confirm Overwrite
ru_ru: Подтвердите перезапись

source: Configure the main editing window
ru_ru: Настроить главное окно редактирования

source: Carry In: an amount to be added into the output
ru_ru: Вход переноса: величина, прибавляемая к выходному значению

source: Output?
ru_ru: Выход?

source: Select Tool
ru_ru: Инструмент Выбор

source: keyboard (buffer cap.
ru_ru: клавиатура (буфер

source: Fill Color
ru_ru: Цвет заливки

source: Analysis cannot handle more than %s inputs.
ru_ru: Анализ не может манипулировать более чем %s входами.

source: Output:
ru_ru: Выход:

source: Low Level
ru_ru: Низкий уровень

source: Wrap around
ru_ru: Закольцовывать

source: File Message
ru_ru: Сообщение файла

source: Wide
ru_ru: Широкий

source: Edit tools associated with mouse buttons.
ru_ru: Редактировать привязки инструментов к кнопкам мыши.

source: Reorder
ru_ru: Перестроить

source: Gates
ru_ru: Элементы

source: Set Main Circuit
ru_ru: Сделать главной схемой

source: Configure file output.
ru_ru: Настройка выходного файла.

source: Clear Contents
ru_ru: Очистить содержимое

source: Toolbar
ru_ru: Панель инструментов

source: Rename
ru_ru: Переименовать

source: Preset: When 1, pin state to 1 asynchronously
ru_ru: Установка: когда 1, состояние асинхронно фиксируется на 1

source: Bit Adder
ru_ru: Сумматор битов

source: Sign
ru_ru: Знак

source: Load: if 1, load memory to output
ru_ru: Чтение: если 1, память считывается на выход

source: User canceled load.
ru_ru: Пользователь отменил загрузку.

source: Untitled
ru_ru: Без имени

source: -plain use standard Logisim template
ru_ru: -plain использовать стандартный шаблон Logisim

source: A: the number preceding the comparison operation
ru_ru: A: первое число для операции сравнения

source: Outputs
ru_ru: Выходы

source: Dot Shape
ru_ru: Форма точки

source: Library includes items currently mapped to the mouse.
ru_ru: Библиотека включает в себя элементы, в настоящее время привязанные к мыши.

source: Clock: values may update on trigger
ru_ru: Тактовый вход: значения могут обновиться при срабатывании

source: Grabber returned false:
ru_ru: Граббер возвратил ложь:

source: Built-in Library...
ru_ru: Встроенная библиотека...

source: Printer view
ru_ru: Вид для печати

source: Unload Libraries...
ru_ru: Выгрузить библиотеки...

source: Do you want to overwrite it?
ru_ru: Хотите перезаписать его?

source: TTY (%s rows, %s cols)
ru_ru: Терминал (%s строк, %s столбцов)

source: << Remove
ru_ru: << Удалить

source: Computing connections...
ru_ru: Расчёт соединений...

source: Move viewed circuit down list
ru_ru: Переместить рассматриваемую схему вниз по списку

source: Tick Frequency
ru_ru: Тактовая частота

source: Copy Selection
ru_ru: Копировать выделение

source: Border & Fill
ru_ru: Граница и заливка

source: Edit ROM Contents
ru_ru: Редактировать содержимое ПЗУ

source: Quit
ru_ru: Выход

source: halted due to detected oscillation
ru_ru: остановлено из-за обнаруженного возбуждения

source: Polygon
ru_ru: Многоугольник

source: Locale given is not supported.
ru_ru: Заданный язык не поддерживается.

source: Enable
ru_ru: Включить

source: Select All
ru_ru: Выбрать все

source: Simulation halted by internal error
ru_ru: Моделирование остановлено из-за внутренней ошибки

source: Toggle whether grid is shown
ru_ru: Переключить отображение сетки

source: %s is not an input variable.
ru_ru: %s не является входной переменной.

source: Remove Mouse Mapping
ru_ru: Удалить привязку мыши

source: Bit Selector
ru_ru: Селектор битов

source: No non-empty circuits are available for printing.
ru_ru: Нет непустых схем, доступных для печати.

source: Pin
ru_ru: Контакт

source: Simulation Limit
ru_ru: Предел моделирования

source: Cut
ru_ru: Вырезать

source: Multiplexer
ru_ru: Мультиплексор

source: Inputs
ru_ru: Входы

source: B: the number following the comparison operation
ru_ru: B: второе число для операции сравнения

source: High Level
ru_ru: Высокий уровень

source: Raise Selection
ru_ru: Поднять выделение

source: Data: ASCII value of buffer's front character
ru_ru: Данные: ASCII значение первого символа буфера

source: North
ru_ru: Север

source: The image could not be created.
ru_ru: Изображение не может быть создано.

source: Could not open file: %s
ru_ru: Невозможно открыть файл: %s

source: Export Image
ru_ru: Экспорт изображения

source: Output: is content of last stage
ru_ru: Выход: содержимое последней ступени

source: Options...
ru_ru: Параметры...

source: Confirm Clear
ru_ru: Подтверждение очистки

source: Enable: steps to next in sequence on clock trigger
ru_ru: Включение: переходить к следующему в последовательности при срабатывании тактового входа

source: Carry In: if 1, an additional 1 is added to output
ru_ru: Вход переноса: если 1, то дополнительная 1 добавляется к выходному значению

source: Write enable: 0 disables clock
ru_ru: Разрешение записи: 0 отключает тактовый вход

source: Error During Open
ru_ru: Ошибка во время открытия

source: (Implicit AND)
ru_ru: (Неявное И)

source: Combined end of splitter
ru_ru: Объединённый конец разветвителя

source: Save RAM Image
ru_ru: Сохранение образа ОЗУ

source: Wiring Tool
ru_ru: Инструмент Проводка

source: attribute value (%s) is not valid for %s
ru_ru: значение атрибута (%s) не подходит для %s

source: Move Up
ru_ru: Сдвинуть вверх

source: Input: one of the numbers to multiply
ru_ru: Вход: одно из чисел для умножения

source: Input Circuit Name
ru_ru: Ввод названия схемы

source: Print Parameters
ru_ru: Параметры печати

source: After adding component:
ru_ru: После добавления компонента:

source: Three-state?
ru_ru: Три состояния?

source: Error Loading Template
ru_ru: Ошибка при загрузке шаблона

source: Image Format:
ru_ru: Формат изображения:

source: -help display this summary and exit
ru_ru: -help отобразить эту сводку и выйти

source: Low Duration
ru_ru: Продолжительность нуля

source: %sKB ROM
ru_ru: %sКБ ПЗУ

source: Circuit used in other circuits cannot be removed.
ru_ru: Схема, используемая в других схемах, не может быть удалена.

source: Incompatible widths
ru_ru: Несовместимые разрядности

source: The file already exists.
ru_ru: Файл уже существует.

source: Add an input pin
ru_ru: Добавить входной контакт

source: The directory could not be created.
ru_ru: Каталог не может быть создан.

source: Subtrahend: the number to subtract from the minuend
ru_ru: Вычитаемое: число, которое отнимается от уменьшаемого

source: Gate shape:
ru_ru: Форма элементов:

source: Cannot Create Directory
ru_ru: Невозможно создать каталог

source: Cannot Analyze
ru_ru: Невозможно анализировать

source: Simulate
ru_ru: Моделировать

source: Medium
ru_ru: Средний

source: Attribute unchanged because request is invalid
ru_ru: Атрибут не изменён, так как запрос неверен

source: Clear: when 1, resets to 0 asynchronously
ru_ru: Очистка: когда 1, асинхронно сбрасывает в 0

source: Template
ru_ru: Шаблон

source: Circular reference detected; computing truth table instead.
ru_ru: Обнаружена циклическая ссылка; составляется таблица истинности.

source: Operator %s missing left operand.
ru_ru: Для оператора %s отсутствует левый операнд.

source: Locate `%s'
ru_ru: Показать `%s'

source: Control Line Location
ru_ru: Расположение управляющего входа

source: Enable: When 0, clock triggers are ineffective
ru_ru: Включение: когда 0, срабатывание тактового входа не даёт эффекта

source: New
ru_ru: Новый

source: Error
ru_ru: Ошибка

source: Output: the result of dividing the dividend by the divisor
ru_ru: Выход: результат деления делимого на делитель

source: Save As...
ru_ru: Сохранить как...

source: The pin is tied to the supercircuit's state.
ru_ru: Значение на контакте привязано к состоянию надсхемы.

source: Appearance Facing
ru_ru: Направление внешнего вида

source: Edit viewed circuit's layout
ru_ru: Редактировать чертёж просматриваемой схемы

source: Output: the two's-complement negation of the input
ru_ru: Выход: инвертированное входное значение в дополнительном коде

source: tool name missing
ru_ru: отсутствует название инструмента

source: `%s' is not a valid library name.
ru_ru: `%s' не является допустимым именем библиотеки.

source: Add an output pin
ru_ru: Добавить выходной контакт

source: Enable Input: 0 disables the component
ru_ru: Разрешающий вход: 0 отключает компонент

source: Pull Down
ru_ru: Понижать

source: Odd Parity
ru_ru: Нечётность

source: halted due to halt pin
ru_ru: остановлено в соответствии с остановочным контактом

source: Cancel Open
ru_ru: Отменить открытие

source: Zoom
ru_ru: Масштабировать

source: XML formatting error: %s
ru_ru: ошибка форматирования XML: %s

source: Register
ru_ru: Регистр

source: The clipboard contents cannot be pasted into the editor.
ru_ru: Содержимое буфера обмена не может быть вставлено в редактор.

source: Off Color
ru_ru: Цвет выключенных

source: Error for undefined inputs
ru_ru: Ошибка для неопределённых входов

source: Color
ru_ru: Цвет

source: -template file use file as template
ru_ru: -template файл использовать файл в качестве шаблона

source: Controlled Inverter
ru_ru: Управляемый инвертор

source: Pull Up
ru_ru: Повышать

source: Plain
ru_ru: Простой

source: Bit Width In
ru_ru: Разрядность входа

source: Confirm Close
ru_ru: Подтверждение закрытия

source: %sKB RAM
ru_ru: %sКБ ОЗУ

source: Clock: value may update on trigger
ru_ru: Тактовый вход: значение может обновиться при срабатывании

source: Drop Component
ru_ru: Сбросить компонент

source: Clock: value updates on trigger
ru_ru: Тактовый вход: значение обновляется при срабатывании

source: Keep connections while moving
ru_ru: Сохранять соединения при перемещении

source: Background
ru_ru: Фон

source: Bit Width Out
ru_ru: Разрядность выхода

source: Select the current template
ru_ru: Выбрать текущий шаблон

source: Could Not Build Circuit
ru_ru: Невозможно построить схему

source: Font
ru_ru: Шрифт

source: Tick Once
ru_ru: Один такт

source: Undo %s
ru_ru: Отменить %s

source: None
ru_ru: Нет

source: Add >>
ru_ru: Добавить >>

source: Unrecognized characters: %s
ru_ru: Символы не распознаны: %s

source: Show ghosts while adding
ru_ru: Показывать призраки во время добавления

source: View and edit the set of input variables.
ru_ru: Просмотреть и редактировать набор входных переменных.

source: No
ru_ru: Нет

source: Go Out To State
ru_ru: Состояние уровнем выше

source: Configure behavior of layout editor
ru_ru: Настроить поведение редактора чертежа

source: Label Facing
ru_ru: Направление метки

source: Alignment
ru_ru: Выравнивание

source: Loading file...
ru_ru: Загрузка файла...

source: Mouse
ru_ru: Мышь

source: View and manipulate outputs' expressions.
ru_ru: Просмотреть и изменять выражения для выходов.

source: Value must be %s or less.
ru_ru: Значение должно быть %s или меньше.

source: Add Wires
ru_ru: Добавить провода

source: Load Logisim File
ru_ru: Загрузить файл Logisim

source: Show project toolbar
ru_ru: Показать панель инструментов проекта

source: Maximize
ru_ru: Максимизировать

source: Save...
ru_ru: Сохранить...

source: Address: location accessed in memory
ru_ru: Адресу: место в памяти, к которому производится доступ

source: Numeric Type
ru_ru: Формат числа

source: Delete Selection
ru_ru: Удалить выделение

source: Logisim: %s of %s
ru_ru: Logisim: %s из %s

source: Select: identifies which output receives input
ru_ru: Выбирающий вход: определяет, на какой выход посылается значение со входа

source: (empty)
ru_ru: (пусто)

source: Raise
ru_ru: Поднять

source: Select: identifies which output is 1
ru_ru: Выбирающий вход: определяет, на каком выходе 1

source: LED Matrix
ru_ru: Светодиодная матрица

source: Add wires to circuit
ru_ru: Добавлять провода в схему

source: component `%s' not found
ru_ru: компонент `%s' не найден

source: Bit %s
ru_ru: Бит %s

source: Second radix when wire poked:
ru_ru: Второе основание при нажатии на провод:

source: Set %s
ru_ru: Установить %s

source: Gate output when undefined
ru_ru: Выход элемента при неопределённости

source: Italic
ru_ru: Курсив

source: Columns
ru_ru: Столбцы

source: Type
ru_ru: Тип

source: Maximum Value
ru_ru: Максимальное значение

source: Component cannot have negative coordinates.
ru_ru: Компонент не может иметь отрицательные координаты.

source: File Already Exists
ru_ru: Файл уже существует

source: The clipboard goes beyond the end of the table.
ru_ru: Буфер выходит за пределы таблицы.

source: Help
ru_ru: Справка

source: Value is not a valid integer
ru_ru: Значение не является допустимым целым

source: %sGB ROM
ru_ru: %sГБ ПЗУ

source: Close Window
ru_ru: Закрыть окно

source: -nosplash hides splash screen at startup
ru_ru: -nosplash скрывает заставку при запуске

source: (None)
ru_ru: (Нет)

source: The clipboard goes beyond the end of the file.
ru_ru: Буфер выходит за пределы файла.

source: Analyze Circuit
ru_ru: Анализировать схему

source: Replace Extension
ru_ru: Сменить расширение

source: Bit %s from combined end
ru_ru: Бит %s с объединённого конца

source: T Flip-Flop
ru_ru: T триггер

source: Change Radix
ru_ru: Изменить основание

source: Add Circuit...
ru_ru: Добавить схему...

source: Carry: is 1 when value reaches maximum (minimum if decrementing)
ru_ru: Перенос: 1, когда значение достигает максимума (минимума при уменьшении)

source: Decoder
ru_ru: Декодер

source: %s KHz
ru_ru: %s кГц

source: Divider
ru_ru: Делитель

source: Java Archive (*.jar)
ru_ru: Архив Java (*.jar)

source: Enable features that haven't yet been thoroughly tested
ru_ru: Включить возможности, которые еще не были тщательно протестированы

source: Logical Left
ru_ru: Логический левый

source: No permission to read template file %s.
ru_ru: Нет прав на чтение файла шаблона %s.

source: Replace "%s"
ru_ru: Заменить "%s"

source: Dividend Lower: the lower half of the number to divide
ru_ru: Низ делимого: младшая половина числа для деления

source: Separate load and store ports
ru_ru: Раздельные порты чтения и записи

source: German Translation
ru_ru: Немецкий перевод

source: Change Selection Attribute
ru_ru: Изменить атрибут выделения

source: The Logisim library has an unrecognized type %s (%s)
ru_ru: Библиотека Logisim имеет неизвестный тип %s (%s)

source: Library
ru_ru: Библиотека

source: Index: index of input's highest-order %s
ru_ru: Номер: номер старшего бита %s во входном значении

source: One synchronous load/store port
ru_ru: Один синхронный порт чтения/записи

source: Window
ru_ru: Окно

source: Negate %s
ru_ru: Инвертировать %s

source: RAM
ru_ru: ОЗУ

source: Minimized
ru_ru: Минимизация

source: Bold Italic
ru_ru: Полужирный курсив

source: Output: the products of the inputs, plus the carry in
ru_ru: Выход: произведение входов плюс вход переноса

source: Poke Tool
ru_ru: Инструмент Нажатие

source: Action On Overflow
ru_ru: Действие при переполнении

source: User's Guide
ru_ru: Руководство пользователя

source: Layout
ru_ru: Чертёж

source: Port
ru_ru: Порт

source: Curve
ru_ru: Кривая

source: Remove viewed circuit
ru_ru: Удалить рассматриваемую схему

source: Add %s
ru_ru: Добавить %s

source: Clear: when 1, resets all to 0 asynchronously
ru_ru: Очистка: когда 1, асинхронно сбрасывает все в 0

source: Reset Simulation
ru_ru: Сбросить моделирование

source: Matrix Columns
ru_ru: Столбцы матрицы

source: Base
ru_ru: Базовые

source: Print...
ru_ru: Печать...

source: Even Parity
ru_ru: Чётность

source: Could not load help data.
ru_ru: Невозможно загрузит данные справки.

source: The file "%s" already exists.
ru_ru: Файл "%s" уже существует.

source: Clear
ru_ru: Очистить

source: Right-Handed
ru_ru: По правую руку

source: Direction
ru_ru: Направление

source: Input: the bits to be searched
ru_ru: Вход: биты для поиска

source: Are you sure you want to replace the circuit %s?
ru_ru: Вы уверены, что хотите заменить схему %s?

source: Language:
ru_ru: Язык:

source: No TTY or Keyboard component was found.
ru_ru: Не найдено компонентов Терминал или Клавиатура.

source: The %s library could not be instantiated.
ru_ru: Невозможно создать экземпляр библиотеки %s.

source: International
ru_ru: Международные

source: Right
ru_ru: Справа

source: Could not open file.
ru_ru: Не удалось открыть файл.

source: Move Handle
ru_ru: Переместить указатель

source: Output: the difference of the minuend and the subtrahend
ru_ru: Выход: разность между уменьшаемым и вычитаемым

source: Facing
ru_ru: Направление

source: Seed
ru_ru: Семя

source: View %s
ru_ru: Рассмотреть %s

source: View and edit the set of output variables.
ru_ru: Просмотреть и редактировать набор выходных переменных.

source: Oval
ru_ru: Овал

source: Select Export Directory
ru_ru: Выбор каталога для экспорта

source: Replace accented characters
ru_ru: Заменять специфичные символы

source: Logical Right
ru_ru: Логический правый

source: Creating file...
ru_ru: Создание файла...

source: Multiple-Input Behavior
ru_ru: Многовходовое поведение

source: Logisim 1.0 8-Bit Register
ru_ru: Logisim 1.0 8-битный регистр

source: Edit Circuit Appearance
ru_ru: Редактировать внешний вид схемы

source: Pull Behavior
ru_ru: Обращение с плавающими

source: Revert All To Template
ru_ru: Вернуть все к шаблону

source: File Already Open
ru_ru: Файл уже открыт

source: Data Bits
ru_ru: Биты данных

source: No bits from combined end
ru_ru: Нет бит с объединённого конца

source: Could not save file: %s
ru_ru: Невозможно сохранить файл: %s

source: Output
ru_ru: Выход

source: To Map %s
ru_ru: чтобы привязать %s

source: Logisim 1.0 file includes unsupported RAM component.
ru_ru: Файл Logisim 1.0 содержит неподдерживаемый компонент ОЗУ.

source: Move viewed circuit up list
ru_ru: Переместить рассматриваемую схему вверх по списку

source: Add
ru_ru: Добавить

source: You do not have permission to write to "%s."
ru_ru: У вас нет разрешения на запись в "%s."

source: wire start misformatted
ru_ru: начало провода имеет неверный формат

source: %s Hz (%s ticks in %s milliseconds)
ru_ru: %s Гц (%s тактов за %s миллисекунд)

source: Logisim 1.0 D Flip-Flop
ru_ru: Logisim 1.0 D триггер

source: Remainder: the remainder (dividend - output * divisor)
ru_ru: Остаток: остаток (делимое - частное*делитель)

source: %s Hz
ru_ru: %s Гц

source: Move Down
ru_ru: Сдвинуть вниз

source: Value
ru_ru: Значение

source: Input: the bits to be counted
ru_ru: Вход: биты для подсчета

source: Output: value of selected group of bits from data
ru_ru: Выход: значение выбранной из данных группы бит

source: Input Format
ru_ru: Формат входа

source: Overwrite
ru_ru: Перезаписать

source: -clearprops clear application preferences at startup
ru_ru: -clearprops очистить настройки приложения при запуске

source: Destination Project:
ru_ru: Целевой проект:

source: Clock: trigger adds character on input
ru_ru: Тактовый вход: срабатывание добавляет символ на вход

source: Library Reference
ru_ru: Справка по библиотеке

source: Select...
ru_ru: Выбрать...

source: Class Name:
ru_ru: Имя класса:

source: Greater: 1 if A is greator than B
ru_ru: Больше: 1, если A больше, чем B

source: One asynchronous load/store port
ru_ru: Один асинхронный порт чтения/записи

source: Current flip-flop state
ru_ru: Текущее состояние триггера

source: Custom template:
ru_ru: Специальный шаблон:

source: Switch to Edit Tool
ru_ru: Переключиться на Инструмент Правка

source: usage: java %s [options] [filenames]
ru_ru: использование: java %s [параметры] [имена_файлов]

source: -tty format run without graphical interface
ru_ru: -tty формат запустить без графического интерфейса

source: Buffer Length
ru_ru: Длина буфера

source: options:
ru_ru: параметры:

source: Computing Image...
ru_ru: Вычисление изображения...

source: Carry Out: 1 if the sum overflows the available bits
ru_ru: Выход переноса: 1, если сумма переполняет доступные биты

source: Number of Stages
ru_ru: Количество ступеней

source: Library includes items currently in the toolbar.
ru_ru: Библиотека включает в себя элементы, находящиеся сейчас на панели инструментов.

source: Index: index of input's lowest-order %s
ru_ru: Номер: номер младшего бита %s во входном значении

source: High Duration
ru_ru: Продолжительность единицы

source: Change values within circuit
ru_ru: Изменять значения в схеме

source: Data Interface
ru_ru: Интерфейс данных

source: Logisim: Hex Editor
ru_ru: Logisim: шестнадцатеричный редактор

source: Label Font
ru_ru: Шрифт метки

source: PNG Files (*.png)
ru_ru: Файлы PNG (*.png)

source: Hex Editor
ru_ru: Шестнадцатеричный редактор

source: Add Mouse Mapping
ru_ru: Добавить привязку мыши

source: Lose Changes
ru_ru: Потерять изменения

source: Down middle
ru_ru: Посередине вниз

source: Confirm Quit
ru_ru: Подтвердить выход

source: Error encountered opening %s: %s
ru_ru: Произошла ошибка открытия %s: %s

source: Load: when 1, loads from data input (if Count = 0) or decrements
ru_ru: Загрузка: когда 1, загружает с входа данных (если Счёт = 0) или уменьшает

source: Opening template...
ru_ru: Открытие шаблона...

source: Bold
ru_ru: Полужирный

source: Cannot Remove Circuit
ru_ru: Невозможно удалить цепь

source: Edit Text
ru_ru: Редактировать текст

source: Click Using Combination
ru_ru: Щёлкните здесь используя комбинацию,

source: Discard
ru_ru: Не сохранять

source: Save
ru_ru: Сохранить

source: Append "%s"
ru_ru: Добавить "%s"

source: The required library file `%s' is missing.
ru_ru: Необходимый файл библиотеки `%s' отсутствует.

source: Name duplicates existing variable.
ru_ru: Имя дублирует существующую переменную.

source: Analysis cannot handle multibit inputs.
ru_ru: Анализ не может манипулировать многобитными входами.

source: %sGB RAM
ru_ru: %sГБ ОЗУ

source: Change Label
ru_ru: Изменить метку

source: Label Color
ru_ru: Цвет метки

source: Are you sure you wish to zero out the memory?
ru_ru: Вы уверены, что хотите обнулить память?

source: Extension Type
ru_ru: Тип расширения

source: TTY
ru_ru: Терминал

source: Tutorial
ru_ru: Пособие начинающего

source: Go In To State
ru_ru: Состояние уровнем ниже

source: Hidden
ru_ru: Скрыта

source: Add circuit
ru_ru: Добавить схему

source: Cannot substitute the same file multiple times.
ru_ru: Невозможно заменить тот же файл несколько раз.

source: Shift: shift is disabled when 0
ru_ru: Сдвиг: сдвиг выключен, если 0

source: Load: when 1 (with shift = 0), all stages load from inputs
ru_ru: Загрузка: когда 1 (при Сдвиг = 0), все ступени загружаются со входов

source: Move Circuit Up
ru_ru: Переместить схему вверх

source: Open Recent
ru_ru: Открыть недавние

source: Bottom
ru_ru: Снизу

source: Clear: 1 clears screen
ru_ru: Очистка: 1 очищает экран

source: Revert To Default Appearance
ru_ru: Вернуть внешний вид по умолчанию

source: Enter
ru_ru: Ввести

source: Empty template
ru_ru: Пустой шаблон

source: Demultiplexer
ru_ru: Демультиплексор

source: Keep at component tool
ru_ru: Остаться на инструменте Компонент

source: Testing
ru_ru: Тестирование

source: The file could not be created.
ru_ru: Файл не может быть создан.

source: (Reached maximum size of %s.)
ru_ru: (Достигнут максимальный размер %s.)

source: Can't Undo
ru_ru: Невозможно отменить

source: Close
ru_ru: Закрыть

source: Add Circuit
ru_ru: Добавить схему

source: Select: identifies which input becomes output
ru_ru: Выбирающий вход: определяет, какой вход становится выходом

source: Data: value to load into counter
ru_ru: Данные: значение для загрузки в счётчик

source: NOT Gate
ru_ru: Элемент НЕ

source: The %s class was not found in the JAR file.
ru_ru: Класс % не был найден в JAR файле.

source: library name missing
ru_ru: отсутствует имя библиотеки

source: Add Separator
ru_ru: Добавить разделитель

source: Circuit oscillates.
ru_ru: Схема возбуждается.

source: The file %s, already open, has unsaved changes.
ru_ru: Уже открытый файл %s имеет несохранённые изменения.
